import { formatDate } from "./Common10.js";

/*
 色々な型と繰り返し

  <実施内容>
  1. formatDateを実行し、その結果をコンソールに出力する。結果は以下となるように引数を設定すること
  　2022年7月12日
*/



/*
  2. formatDateを実行し、その結果をコンソールに出力する。結果は以下となるように引数を設定すること
  　月の指定が不正です:XX 1～12を指定して下さい
  　※XXは任意の値で良い
*/

/*
  3. formatDateを実行し、その結果をコンソールに出力する。結果は以下となるように引数を設定すること
  　日の指定が不正です:XX 1～31を指定して下さい
  　※XXは任意の値で良い
*/

/*
  4. selectCatTypeを参考に関数selectDogTypeを作成する
  　Animal型を使用し犬科の動物と犬科以外の動物を作成し、配列に格納する
  　作成した配列をselectDogTypeの引数として渡し実行する
  　実行した結果をコンソールに出力する
*/

/*
  5. 以下の条件を満たすようにselectAnyTypeに処理を追加する
  　　第一引数は動物の配列(selectCatTypeやselectDogTypeと同じ)
  　　第二引数は取得した動物の種類を設定する
*/

/*
  6. 作成したselectAnyTypeについて、以下の引数を渡して実行する
  　　第一引数はSampleで作成していたanimalsと同じもの
  　　第二引数は'cat'
  　　サンプルの実行結果と同じになること
*/

/*
  7. 作成したselectAnyTypeについて、以下の引数を渡して実行する
  　　第一引数は4で使用していた配列と同じもの
  　　第二引数は'dog'
  　　課題4の実行結果と同じになること
*/

/*
  8. filterTypeの内容を確認し、処理内容を理解する
*/

